In [102]:
import pandas as pd
df=pd.DataFrame({'color':['red','blue','green','green','red','blue']})

In [103]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder=LabelEncoder()

In [104]:
lbl_encoder.fit_transform(df[['color']])

c:\Users\Ilya\Documents\Data science course\.venv\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 1, 2, 0])

In [105]:
lbl_encoder.transform([['red']])

c:\Users\Ilya\Documents\Data science course\.venv\Lib\site-packages\sklearn\preprocessing\_label.py:129: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [106]:
# Ordinal encoding
from sklearn.preprocessing import OrdinalEncoder
ord_encoder=OrdinalEncoder()

In [107]:
df = pd.DataFrame({'size': ['small', 'medium', 'large', 'medium', 'small', 'large']})
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [108]:
# create instance of OrdinalEncoder and then perform fit.transform

encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [109]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [110]:
encoder.transform([['small']])

c:\Users\Ilya\Documents\Data science course\.venv\Lib\site-packages\sklearn\utils\validation.py:2749: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

In [111]:
df = pd.DataFrame({
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix','Los Angeles'],
    'price': [850000, 650000, 450000, 300000, 400000, 700000]
    })

In [112]:
mean_price=df.groupby('city')['price'].mean()
mean_price

city
Chicago        450000.0
Houston        300000.0
Los Angeles    675000.0
New York       850000.0
Phoenix        400000.0
Name: price, dtype: float64

In [113]:
df['city_encoded']=df['city'].map(mean_price)
df

          city   price  city_encoded
0     New York  850000      850000.0
1  Los Angeles  650000      675000.0
2      Chicago  450000      450000.0
3      Houston  300000      300000.0
4      Phoenix  400000      400000.0
5  Los Angeles  700000      675000.0

In [114]:
df[['price','city_encoded']]

    price  city_encoded
0  850000      850000.0
1  650000      675000.0
2  450000      450000.0
3  300000      300000.0
4  400000      400000.0
5  700000      675000.0

In [115]:
import seaborn as sns
df=sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [116]:
mean_price=df.groupby('time')['total_bill'].mean()
mean_price

C:\Users\Ilya\AppData\Local\Temp\ipykernel_29256\3235048907.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_price=df.groupby('time')['total_bill'].mean()

time
Lunch     17.168676
Dinner    20.797159
Name: total_bill, dtype: float64

In [117]:
df['time_encoded']=df['time'].map(mean_price)

Empty DataFrame
Columns: [time, time_encoded]
Index: []